{
  "id": "profile",
  "title": "Your Profile & Trust Journey",
  "subtitle": "Build your civic identity step by step — from new user to fully verified citizen.",
  "generated": "2026-03-01T01:01:57.201Z",
  "stepCount": 10,
  "steps": [
    {
      "number": 1,
      "title": "Open your Profile",
      "description": "After logging in, click \"My TPB\" in the navigation bar, then click \"My Profile.\" This is your civic identity — who you are, where you live, your trust level, and your civic points. The nav bar shows your town, point total, and current trust level at a glance.",
      "alt": "Profile page showing the Trust Journey progress bar and all profile sections",
      "screenshot": "profile-01-overview.png"
    },
    {
      "number": 2,
      "title": "Your Trust Journey",
      "description": "At the top of your profile, a progress bar shows your Trust Journey. Each step you complete earns civic points and raises your trust level. The steps are: Arrived (+1), Location (+50), Name (+50), Email Verified (+50), and Phone 2FA (+50). Your total civic points appear on the right. As you complete steps, the icons light up in gold.",
      "alt": null,
      "screenshot": null
    },
    {
      "number": 3,
      "title": "Set your location",
      "description": "In the Location section, select your state and type your town name. Once set, your profile shows your town, zip code, and congressional districts (e.g., \"CT-2 • Senate 29 • House 51\"). You can also add a street address (optional) and click \"Go to My Town\" to visit your town's civic page.",
      "alt": null,
      "screenshot": null
    },
    {
      "number": 4,
      "title": "Fill in your identity",
      "description": "In the Identity section, enter your first name, last name, and age range. A green check mark appears next to each completed field. These are required for volunteering and help the community know who they're talking to.",
      "alt": null,
      "screenshot": null
    },
    {
      "number": 5,
      "title": "Set your privacy preferences",
      "description": "The Privacy Settings section lets you choose what others see when you post in Talk or vote. Toggle checkboxes for first name, last name, and age bracket. A live preview shows exactly how your name will appear to other citizens — for example, \"har Goodwin (55-64)\" or just your first name.",
      "alt": null,
      "screenshot": null
    },
    {
      "number": 6,
      "title": "Turn on notifications",
      "description": "In the Notifications section, check \"Daily threat bulletin email (8 AM ET)\" to receive a daily email summarizing new threats. Click \"Save Changes\" to apply your privacy and notification preferences.",
      "alt": null,
      "screenshot": null
    },
    {
      "number": 7,
      "title": "Verify your email",
      "description": "In the Verification section, your email address is shown. If not yet verified, click \"Send Verification Link,\" check your email, and click the link. Once verified, a green \"✓ Verified\" badge appears and your trust level rises to Level 2 (Remembered). You can now post ideas in Talk and vote on threats.",
      "alt": null,
      "screenshot": null
    },
    {
      "number": 8,
      "title": "Verify your phone for 2FA",
      "description": "Below email verification, enter your phone number and click \"Verify.\" You'll receive a text message with a verification link. Once confirmed, a green \"✓ Verified\" badge appears next to your phone number and your trust level rises to Level 3 (Verified) — the highest standard trust level. Two-factor authentication protects your account and unlocks the Volunteer section.",
      "alt": null,
      "screenshot": null
    },
    {
      "number": 9,
      "title": "Set a password",
      "description": "In the Password section, you can create or change your password. This is optional — you can always log in via email link — but a password lets you log in faster. Enter your current password (if changing), then your new password (at least 8 characters), confirm it, and click \"Change Password.\" A green \"✓ Set\" badge confirms it's active.",
      "alt": null,
      "screenshot": null
    },
    {
      "number": 10,
      "title": "Volunteer section",
      "description": "Once fully verified (Level 3), a Volunteer section appears at the bottom of your profile. If approved, it shows \"✓ Approved Volunteer — You're part of the team!\" Below that, select your skills from a grid of 15 areas (Technical, Content, Designer, Project Management, etc.), pick a primary skill, and write a short bio. Click \"Save Volunteer Info\" and then \"Go to Volunteer Workspace\" to start contributing.",
      "alt": null,
      "screenshot": null,
      "link": {
        "url": "/help/guide.php?flow=volunteer",
        "label": "Read the full Becoming a Volunteer guide"
      }
    }
  ]
}