{
  "id": "talk",
  "title": "Using Talk",
  "subtitle": "Share ideas, vote, reply, and brainstorm with your community.",
  "generated": "2026-03-01T01:09:19.075Z",
  "stepCount": 6,
  "steps": [
    {
      "number": 1,
      "title": "Open USA Talk",
      "description": "Click \"USA Talk\" in the main navigation bar. This is the national civic brainstorming stream where citizens share ideas, ask questions, and propose solutions.",
      "alt": "The Talk stream page showing ideas from citizens across the USA",
      "screenshot": "talk-01-stream.png"
    },
    {
      "number": 2,
      "title": "Write your idea",
      "description": "If you're verified, you'll see a text box at the top. Type your thought, question, or idea. You can write up to 2,000 characters. Press Enter or click the send arrow to post.",
      "alt": "The Talk input area with text box and send button",
      "screenshot": "talk-02-input.png"
    },
    {
      "number": 3,
      "title": "Use AI Brainstorm",
      "description": "Click the \"AI\" button next to the text box to toggle AI brainstorm mode. When enabled, after you post your idea, an AI assistant will respond with analysis and suggestions to help refine your thinking.",
      "alt": "The AI toggle button highlighted next to the text input",
      "screenshot": null
    },
    {
      "number": 4,
      "title": "Vote on ideas",
      "description": "Every idea has thumbs-up and thumbs-down buttons. Vote to signal agreement or disagreement. Your vote helps the community see which ideas have support.",
      "alt": "An idea card showing vote buttons",
      "screenshot": null
    },
    {
      "number": 5,
      "title": "Filter by status",
      "description": "Use the filter buttons at the top of the stream — All, Raw, Refining, Distilled, Actionable. Ideas mature as the community discusses and refines them.",
      "alt": "Filter bar showing status options: All, Raw, Refining, Distilled, Actionable",
      "screenshot": null
    },
    {
      "number": 6,
      "title": "Browse by location",
      "description": "Talk works at three levels: USA (national), your state, and your town. Visit your state or town page to see local conversations. The breadcrumb at the top shows where you are: USA > State > Town.",
      "alt": "Talk page showing geographic breadcrumb navigation",
      "screenshot": "talk-06-geo.png"
    }
  ]
}