{
  "id": "volunteer",
  "title": "Becoming a Volunteer",
  "subtitle": "From the bottom of your profile to an approved volunteer — the complete journey.",
  "generated": "2026-03-01T01:09:37.539Z",
  "stepCount": 9,
  "steps": [
    {
      "number": 1,
      "title": "The Volunteer section on your profile",
      "description": "Once you reach Trust Level 3 (phone verified), a Volunteer section appears at the bottom of your profile page. It shows your approval status, a grid of 15 skill areas you can select (Technical, Content, Designer, Project Management, etc.), a primary skill dropdown, and a bio text area. If you haven't applied yet, you'll see an \"Apply to Volunteer\" button.",
      "alt": "Profile page scrolled to the Volunteer section at the bottom",
      "screenshot": "volunteer-01-profile-section.png"
    },
    {
      "number": 2,
      "title": "Profile requirements",
      "description": "Before you can apply, your profile must be fully complete: first name, last name, email (verified), state, town, and phone number (2FA verified). If anything is missing, the application page will tell you exactly what to fill in. This is the same trust standard we hold everyone to — because trust matters.",
      "alt": null,
      "screenshot": null
    },
    {
      "number": 3,
      "title": "Log in with a magic link",
      "description": "If you're not logged in, you can get a magic link sent to your email. Enter your email address, click \"Send Verification Link,\" and check your inbox. Click the link in the email — it logs you in instantly, no password needed. The link works on any device and brings you right back to where you were.",
      "alt": null,
      "screenshot": null
    },
    {
      "number": 4,
      "title": "Open the volunteer application",
      "description": "Click \"Apply to Volunteer\" on your profile, or go to the Volunteer section in the navigation bar and click \"Apply.\" The application page shows your verified profile info at the top — name, email, location, phone — confirming you meet the trust requirements.",
      "alt": "Volunteer application page showing verified profile info and the application form",
      "screenshot": "volunteer-04-apply.png"
    },
    {
      "number": 5,
      "title": "Fill out your application",
      "description": "Tell us your age range, what skills you can contribute, why you want to help build TPB, a bit about your background, and how much time you can give. If you're under 18, you'll need a parent or guardian's name and email. You can also add verification links (LinkedIn, GitHub, personal website) or name someone who can vouch for you. Check the two agreement boxes and click \"Submit Application.\"",
      "alt": null,
      "screenshot": null
    },
    {
      "number": 6,
      "title": "Application submitted",
      "description": "After you submit, you'll see a confirmation page: \"Application Submitted!\" with a summary of what happens next. You earn 50 civic points for applying. If you visit the apply page again while pending, it shows \"Application Pending\" with the date you applied.",
      "alt": null,
      "screenshot": null
    },
    {
      "number": 7,
      "title": "Wait for approval",
      "description": "A project manager receives an email with your full application — your profile, motivation, experience, availability, and any verification links. They review it and decide. You'll get an email notification when you're approved.",
      "alt": null,
      "screenshot": null
    },
    {
      "number": 8,
      "title": "You're approved — enter the workspace",
      "description": "Once approved, your profile shows \"✓ Approved Volunteer — You're part of the team!\" and you get access to the Volunteer Workspace. Click \"Volunteer\" in the navigation bar or \"Go to Volunteer Workspace\" on your profile. The workspace shows a task board with tabs: My Work, Available, Completed, and PM (for project managers).",
      "alt": "Volunteer workspace showing the task board with tabs and available tasks",
      "screenshot": "volunteer-08-workspace.png"
    },
    {
      "number": 9,
      "title": "Claim and complete tasks",
      "description": "Browse \"Available\" tasks to find work that matches your skills. Click a task to see details, then claim it. Once claimed, it moves to \"My Work.\" When you finish, submit it for completion review. A project manager reviews your work and marks it complete. Every completed task earns civic points and helps build the platform.",
      "alt": null,
      "screenshot": null
    }
  ]
}